---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.NewtonsPerMeter
source: html/ac7fdd94-b9e5-6ef0-323a-dfa1e177845e.htm
---
# Autodesk.Revit.DB.UnitTypeId.NewtonsPerMeter Property

Newtons per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId NewtonsPerMeter { get; }
```